export type question = {
    title: string
    content: string
}
export type allQuestion = {
    title: string
    contents: question[]
}

export const dataAll: allQuestion = {
    title: "常见问题",
    contents: [{
        title: "什么是区块哈希(Block hash)?",
        content: "区块哈希是一段数据的DNA，每个区块哈希都是唯一的、随机的且不可破解的。 点击查看百度百科哈希值介绍。"
    }, {
        title: "什么是区块链？",
        content: "区块链从本质上讲，它是一个共享数据库，存储于其中的数据或信息。具有不可伪造、全程留痕、可以追溯、公开透明、集体维护等特征"
    }, {
        title: "中心化钱包？去中心化钱包？为什么中心化钱包无法查询转账？",
        content: "举一个例子：您自己的钱包地址是A，您给地址E转入10个USDT，但您用交易哈希值去查询，只能查询到服务商随机某个账本地址B（或C或D等等）与E的转账。 同理E也无法得知这10个USDT是否是您转出的，因为E只能看见是账本地址B给他转入10个USDT。这就是为什么中心化钱包无法在区块链上查询真实转账信息。"
    }, {
        title: "为什么我会连续中奖或不中奖？",
        content: "首先连续多次不中奖的是小概率事件（小概率事件定义），其次中奖与不中奖是随机事件，随机事件的发生的频率会趋于一个稳定值。 在非迭代的情况下，事物出现的概率对每个人来讲是相等的，这个情况下，每个人都是公平的。 同时随机事件会遵大数定律（在试验不变的条件下，重复试验多次，随机事件的频率近似于它的概率大数定律定义），在转账频次不断增加的情况下，中奖与不中奖的概率会趋于一个稳定值。 所以请您继续转账，随着转账频次增加则中奖总概率会提升。"
    }, {
        title: "为什么会延迟到帐？",
        content: "由于区块链技术为了保证资金的安全性，会进行多次核算，比对，确认。所以计算速度较慢，但是贵在安全。"
    }, {
        title: "为什么转币时有那么多USDT的类型选项？我该选哪一个？",
        content: "全球有许多知名公链都支持进行USDT转账，而幸运哈希是基于波场TRC20技术。 所以幸运哈希的转账地址是属于USDT-TRC20， 您应该选择USDT-TRC20； 如果您选择了其他类型，Tron58则无法收到您的USDT，这会造成您和Tron58双方的损失。"
    }, {
        title: "转币时转错地址或者选错币的类型，怎么办？是否还能找回？",
        content: "比如说您给我们转币时应该选择USDT-TRC20类型，但您选择了其他类型USDT-OMNI或者USDT-ERC20，那么就会出现丢币的情况，这种情况是无法找回的。"
    }]
}